[
  {
    "name": "Dynamic Duel",
    "tools": "Built with Javascript, CSS, MongoDB and Mongoose, Express.js, React, Node.js, JWT Authentication, and a third-party API.  The backend is deployed on Heroku and the frontend on Netlify.",
    "description":"Designed a full-stack MERN application utilizing a 3rd Party Superhero API.  Users are able to login using JWT authentication, look up superheroes, favorite their top three , and create posts that pit supers against each other in battle and socially with other users.  The frontend is designed with React and the backend is built using RESTful routes that allow CRUD operations.",
    "live": "https://dynamic-duel.netlify.app/",
    "git": "https://github.com/joekgilberto/dynamic-duel",
    "image": "dynamic-duel.png"
  },
  {
    "name": "Shop 'n' List",
    "tools": "Built with JavaScript, EJS, MongoDB and Mongoose, Express.js, Node.js, and Cloudinary.  Deployed on Heroku.",
    "description":"Created a MEN-stack application to practice selling items and bidding on others' postings.  Utilized RESTful routes that provide users CRUD operations.  Once logged in through Google OAuth, users can create detailed posts, edit those posts, and delete them.  Mongoose schemas were applied to organize data for the listings, their bidding auctions, and categories of items.",
    "live": "https://shop-n-list-bce500242f47.herokuapp.com/listings",
    "git": "https://github.com/joekgilberto/shop-n-list",
    "image": "shop-n-list.png"
  },
    {
      "name": "Battleship",
      "tools": "Built with JavaScript, HMTL, and CSS, and deployed on GitHub Pages.",
      "description":"Made a playable version of Battleship against a computer opponent.  Utilized HTML and CSS to build a thoughtfully designed game board using flexbox and grid layouts.  Wrote JavaScript in MVC architecture that generates random game boards for both the computer and player using recursion, and enabled the computer to make informed guesses by interacting with DOM Elements.",
      "live": "https://joekgilberto.github.io/battleship/",
      "git": "https://github.com/joekgilberto/battleship",
      "image": "battleship.png"
    }
  ]